# Taps
tap "oven-sh/bun"

# Core tools
brew "chezmoi"
brew "mise"
brew "direnv"
brew "zoxide"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "neovim"
brew "tmux"
brew "starship"
brew "atuin"
brew "oven-sh/bun/bun"
brew "node"

# Build dependencies for compiling Ruby/Python via mise (ruby-build, python-build)
brew "openssl"
brew "libyaml"
brew "libffi"
brew "readline"
brew "zlib"

# dark-mode-notify: not in homebrew core — install manually from GitHub releases
# https://github.com/nicholasburns/dark-mode-notify

# GUI apps
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
